In [49]:
import pandas as pd
#read csv file
users_table1=pd.read_csv("users_table1.csv",index_col=0)
#reset index columns to start from 1 instead of default 0
users_table1.index=range(1,len(users_table1)+1)
#display users_table1
users_table1

        Name  Age     Occupation  Salary    Location
1       Mary   29     Accountant  229596     Nairobi
2       Jane   33  Sales Manager  199668      Mumbai
3    Hillary   45          Nurse  277183      Mumbai
4   Napoleon   25        Teacher  165957      Moscow
5      Terry   46  Sales Manager  148843      Mumbai
6       Mane   44        Teacher  169931      Mumbai
7       Sane   29          Nurse  121707     Nairobi
8    Mamadou   28          Nurse  212453       Lagos
9     Claire   39     Accountant  193072      Warsaw
10      Venn   45          Clerk  209527     Nairobi
11      Hill   27          Clerk  212269  Burcharest
12      Joan   30          Clerk  117177       Hanoi
13     Peter   41        Teacher  238860  Washington
14     James   24          Nurse  219939  Washington
15      John   29  Sales Manager  250535      Warsaw

In [50]:
#check for missing values in users_table1
users_table1.isnull().any()

Name          False
Age           False
Occupation    False
Salary        False
Location      False
dtype: bool

In [51]:
#users table2
users_table2=pd.read_csv("users_table2.csv",index_col=0)
#reset index columns to start from 1 instead of default 0
users_table2.index=range(1,len(users_table2)+1)
#display users_table2
users_table2

         Name  Age   Occupation  Salary Location
1      Amelia   28   Accountant   96149   Moscow
2   Alexander   33  Sales Agent   73409   Tehran
3       Clark   27  Sales Agent   90427    Lagos
4     Everlyn   42   Accountant   74886    Lagos
5       Lopez   44      Dentist   94982   Tehran
6      Lamine   36      Plumber   78564   Tehran
7      Fermin   28  Sales Agent   62923   Moscow
8        Diaz   31      Dentist   99980  Nairobi
9       Dante   31      Teacher   98442    Lagos
10    Welbeck   26      Dentist   62531    Lagos
11      Sisse   31      Plumber   95199    Lagos
12       Pato   31   Accountant   57889   Moscow
13       Alex   37        Pilot   51499    Lagos
14    Mathias   34      Dentist   56625   Mumbai
15       Mark   32      Dentist   66948  Nairobi

In [52]:
#check for missing values in users_table2
users_table2.isnull().any()

Name          False
Age           False
Occupation    False
Salary        False
Location      False
dtype: bool

In [53]:
#get summary for salary column for users_table1
users_table1['Salary'].describe()
# count: 15 - There are 15 salary records in the dataset (no missing values).
# mean: $150,202 - The average salary across all 15 employees is about $150,200.
# std: $79,895 - This is the standard deviation
# showing salaries vary widely from the average by roughly $80,000
# This indicates significant salary dispersion in your dataset.
# min: $50,863 - The lowest salary in the dataset is about $50,900.
# 25% (first quartile): $81,179 - 25% of employees earn $81,179 or less.
# 50% (median): $112,031 - Half the employees earn below $112,031 and half earn above it.
# this is considerably lower than the mean ($150,202),
# suggesting the distribution is right-skewed with some high earners pulling the average up.
# 75% (third quartile): $225,908 - 75% of employees earn less than $225,908,
# meaning only the top 25% earn more than this.
#max: $274,244 - The highest salary is about $274,200.
#The large gap between the median ($112,031) and mean ($150,202)
#plus the high standard deviation
#suggests that likely there are  a few high earners significantly above the rest
# The salary range spans from about $51K to $274K, showing substantial variation in compensation levels.

count        15.000000
mean     197781.133333
std       45774.889292
min      117177.000000
25%      167944.000000
50%      209527.000000
75%      224767.500000
max      277183.000000
Name: Salary, dtype: float64

In [13]:
#get salary summary for users_table2
users_table2['Salary'].describe()
#count is 15
#there are no missing values
#mean is roughly 80k 
#thats the aveage salary for all 15 employees
#std: standard deviation is roughly 14k
#showing variations from the mean by roughly 14k 
#lowest salary is about 53800
#25% of employees earn less than 71k
#50% half of employees earn more than 78k and half earn less than 78k
#75% of employees earn less than 93k
#only top 25% earn more than 93k
#mean is higher than median
#data is right skewed
#suggesting we have few high earners pulling the average upwards
#maximum salary is roughly 99k
#overall,salary spans from 53k to 99k
#showing slight variations in salary compensations

count       15.000000
mean     80170.466667
std      14378.682767
min      53897.000000
25%      71789.500000
50%      78541.000000
75%      93473.000000
max      99399.000000
Name: Salary, dtype: float64

In [54]:
#get summary for age column in users_table1
users_table1['Age'].describe()
#total count is for 15 users
#average age is 33 years
#mean is greater than median
#data is right skewed
#more older people are pulling the mean upwards
#std is 8 
#that is the variation of age from the average
#minimum age is 23
#25% of people are about 27 years or less
#50% middle 50% of the people fall between 27.5 years old to 40 years old
#showing a fairly broad age spread
#75% of people are less than 40 years, only top 25% are more than that
#maximum age is 49 years

count    15.000000
mean     34.266667
std       8.092913
min      24.000000
25%      28.500000
50%      30.000000
75%      42.500000
max      46.000000
Name: Age, dtype: float64

In [33]:
#select using labels
#select from name to occupation columns in users_table1
users_table1.loc[:,"Names":"Occupation"]

       Names  Age     Occupation
1       Mary   49     Accountant
2       Jane   24   Data Analyst
3    Hillary   30          Clerk
4   Napoleon   41     Accountant
5      Terry   32          Nurse
6       Mane   39     Accountant
7       Sane   48  Sales Manager
8    Mamadou   24  Sales Manager
9     Claire   34          Clerk
10      Venn   30  Sales Manager
11      Hill   44        Teacher
12      Joan   25        Teacher
13     Peter   33        Teacher
14     James   23          Nurse
15      John   30          Nurse

In [55]:
#rename occupation column to career in users_table1
users_table1.rename(
    columns={"Occupation":"Career"},inplace=True)
users_table1

        Name  Age         Career  Salary    Location
1       Mary   29     Accountant  229596     Nairobi
2       Jane   33  Sales Manager  199668      Mumbai
3    Hillary   45          Nurse  277183      Mumbai
4   Napoleon   25        Teacher  165957      Moscow
5      Terry   46  Sales Manager  148843      Mumbai
6       Mane   44        Teacher  169931      Mumbai
7       Sane   29          Nurse  121707     Nairobi
8    Mamadou   28          Nurse  212453       Lagos
9     Claire   39     Accountant  193072      Warsaw
10      Venn   45          Clerk  209527     Nairobi
11      Hill   27          Clerk  212269  Burcharest
12      Joan   30          Clerk  117177       Hanoi
13     Peter   41        Teacher  238860  Washington
14     James   24          Nurse  219939  Washington
15      John   29  Sales Manager  250535      Warsaw

In [59]:
#add Salary label on users_table1
#ie high or low based on salary amount
users_table1["Salary_label"]=users_table1["Monthly_Salary"].apply(lambda x:"High" if x>250000 else "Low")
users_table1

KeyError: 'Monthly_Salary'

In [60]:
#find all teachers in users_table1 
all_teachers=users_table1['Job_Title']=='Teacher'
# all_teachers.index=range(1,len(all_teachers)+1)
users_table1[all_teachers]

KeyError: 'Job_Title'

In [44]:
#get summary for all cities in users_table1
users_table1['City'].value_counts()
#most people are from Mumbai

City
Mumbai        4
Nairobi       3
Warsaw        2
Washington    2
Moscow        1
Lagos         1
Burcharest    1
Hanoi         1
Name: count, dtype: int64

In [62]:
#add name_city column in users_table1
users_table1["name_city"]=users_table1["Name"]+"_"+"from"+"_"+users_table1["Location"]
users_table1

        Name  Age         Career  Salary    Location              name_city
1       Mary   29     Accountant  229596     Nairobi      Mary_from_Nairobi
2       Jane   33  Sales Manager  199668      Mumbai       Jane_from_Mumbai
3    Hillary   45          Nurse  277183      Mumbai    Hillary_from_Mumbai
4   Napoleon   25        Teacher  165957      Moscow   Napoleon_from_Moscow
5      Terry   46  Sales Manager  148843      Mumbai      Terry_from_Mumbai
6       Mane   44        Teacher  169931      Mumbai       Mane_from_Mumbai
7       Sane   29          Nurse  121707     Nairobi      Sane_from_Nairobi
8    Mamadou   28          Nurse  212453       Lagos     Mamadou_from_Lagos
9     Claire   39     Accountant  193072      Warsaw     Claire_from_Warsaw
10      Venn   45          Clerk  209527     Nairobi      Venn_from_Nairobi
11      Hill   27          Clerk  212269  Burcharest   Hill_from_Burcharest
12      Joan   30          Clerk  117177       Hanoi        Joan_from_Hanoi
13     Peter   41        Teacher  238860  Washington  Peter_from_Washington
14     James   24          Nurse  219939  Washington  James_from_Washington
15      John   29  Sales Manager  250535      Warsaw       John_from_Warsaw

In [73]:
#select from name to career columns based on position
users_table1.iloc[0:10,0:3]

        Name  Age      Job_Title
1       Mary   29     Accountant
2       Jane   33  Sales Manager
3    Hillary   45          Nurse
4   Napoleon   25        Teacher
5      Terry   46  Sales Manager
6       Mane   44        Teacher
7       Sane   29          Nurse
8    Mamadou   28          Nurse
9     Claire   39     Accountant
10      Venn   45          Clerk

In [75]:
#rename Location to City in users_table1
users_table1.rename(columns={"Location":"City"},inplace=True)
#show modified users_table1
users_table1

,Name,Age,Job_Title,Monthly_Salary,City,name_city
1,Mary,29,Accountant,229596,Nairobi,Mary_from_Nairobi
2,Jane,33,Sales Manager,199668,Mumbai,Jane_from_Mumbai
3,Hillary,45,Nurse,277183,Mumbai,Hillary_from_Mumbai
4,Napoleon,25,Teacher,165957,Moscow,Napoleon_from_Moscow
5,Terry,46,Sales Manager,148843,Mumbai,Terry_from_Mumbai
6,Mane,44,Teacher,169931,Mumbai,Mane_from_Mumbai
7,Sane,29,Nurse,121707,Nairobi,Sane_from_Nairobi
8,Mamadou,28,Nurse,212453,Lagos,Mamadou_from_Lagos
9,Claire,39,Accountant,193072,Warsaw,Claire_from_Warsaw
10,Venn,45,Clerk,209527,Nairobi,Venn_from_Nairobi
11,Hill,27,Clerk,212269,Burcharest,Hill_from_Burcharest
12,Joan,30,Clerk,117177,Hanoi,Joan_from_Hanoi
13,Peter,41,Teacher,238860,Washington,Peter_from_Washington
14,James,24,Nurse,219939,Washington,James_from_Washington
15,John,29,Sales Manager,250535,Warsaw,John_from_Warsaw

In [76]:
#rename Salary column to Monthly_Salary in users_table1
users_table1.rename(columns={"Salary":"Monthly_Salary"},inplace=True)
#show modified users_table1
users_table1

,Name,Age,Job_Title,Monthly_Salary,City,name_city
1,Mary,29,Accountant,229596,Nairobi,Mary_from_Nairobi
2,Jane,33,Sales Manager,199668,Mumbai,Jane_from_Mumbai
3,Hillary,45,Nurse,277183,Mumbai,Hillary_from_Mumbai
4,Napoleon,25,Teacher,165957,Moscow,Napoleon_from_Moscow
5,Terry,46,Sales Manager,148843,Mumbai,Terry_from_Mumbai
6,Mane,44,Teacher,169931,Mumbai,Mane_from_Mumbai
7,Sane,29,Nurse,121707,Nairobi,Sane_from_Nairobi
8,Mamadou,28,Nurse,212453,Lagos,Mamadou_from_Lagos
9,Claire,39,Accountant,193072,Warsaw,Claire_from_Warsaw
10,Venn,45,Clerk,209527,Nairobi,Venn_from_Nairobi
11,Hill,27,Clerk,212269,Burcharest,Hill_from_Burcharest
12,Joan,30,Clerk,117177,Hanoi,Joan_from_Hanoi
13,Peter,41,Teacher,238860,Washington,Peter_from_Washington
14,James,24,Nurse,219939,Washington,James_from_Washington
15,John,29,Sales Manager,250535,Warsaw,John_from_Warsaw

In [77]:
#rename career to Job_Title column in users_table1
users_table1.rename(columns={"Career":"Job_Title"},inplace=True)
#show modifed users_table1
users_table1

,Name,Age,Job_Title,Monthly_Salary,City,name_city
1,Mary,29,Accountant,229596,Nairobi,Mary_from_Nairobi
2,Jane,33,Sales Manager,199668,Mumbai,Jane_from_Mumbai
3,Hillary,45,Nurse,277183,Mumbai,Hillary_from_Mumbai
4,Napoleon,25,Teacher,165957,Moscow,Napoleon_from_Moscow
5,Terry,46,Sales Manager,148843,Mumbai,Terry_from_Mumbai
6,Mane,44,Teacher,169931,Mumbai,Mane_from_Mumbai
7,Sane,29,Nurse,121707,Nairobi,Sane_from_Nairobi
8,Mamadou,28,Nurse,212453,Lagos,Mamadou_from_Lagos
9,Claire,39,Accountant,193072,Warsaw,Claire_from_Warsaw
10,Venn,45,Clerk,209527,Nairobi,Venn_from_Nairobi
11,Hill,27,Clerk,212269,Burcharest,Hill_from_Burcharest
12,Joan,30,Clerk,117177,Hanoi,Joan_from_Hanoi
13,Peter,41,Teacher,238860,Washington,Peter_from_Washington
14,James,24,Nurse,219939,Washington,James_from_Washington
15,John,29,Sales Manager,250535,Warsaw,John_from_Warsaw

In [84]:
#fetch only employees from Nairobi in users_table1
employees_from_nairobi=users_table1[users_table1['City']=='Nairobi']
employees_from_nairobi=employees_from_nairobi.reset_index(drop=True)
employees_from_nairobi.index=range(1,len(employees_from_nairobi)+1)
employees_from_nairobi

   Name  Age   Job_Title  Monthly_Salary     City          name_city
1  Mary   29  Accountant          229596  Nairobi  Mary_from_Nairobi
2  Sane   29       Nurse          121707  Nairobi  Sane_from_Nairobi
3  Venn   45       Clerk          209527  Nairobi  Venn_from_Nairobi

In [102]:
#fetch only employees from Warsaw in users_table1
employees_from_warsaw=users_table1[users_table1['City']=='Warsaw']
#rest index
employees_from_warsaw=employees_from_warsaw.reset_index(drop=True)
#let index start from 1 instead of default 0
employees_from_warsaw.index=range(1,len(employees_from_warsaw)+1)
#display results
employees_from_warsaw

     Name  Age      Job_Title  Monthly_Salary    City           name_city
1    John   29  Sales Manager          250535  Warsaw    John_from_Warsaw
2  Claire   39     Accountant          193072  Warsaw  Claire_from_Warsaw

In [103]:
#find out total salaries paid out to employees
total_salaries=users_table1['Monthly_Salary'].sum()
print(f"Total salaries paid out:{total_salaries:,.2f} $")

Total salaries paid out:2,966,717.00 $

In [106]:
#sort users_table1 by salary
#from highest paid to lowest paid
users_table1.sort_values(by=["Monthly_Salary"],inplace=True,ascending=False)
#reset index
users_table1.index=range(1,len(users_table1)+1)
#display results
users_table1

,Name,Age,Job_Title,Monthly_Salary,City,name_city,Salary_label
1,Hillary,45,Nurse,277183,Mumbai,Hillary_from_Mumbai,High
2,John,29,Sales Manager,250535,Warsaw,John_from_Warsaw,High
3,Peter,41,Teacher,238860,Washington,Peter_from_Washington,Low
4,Mary,29,Accountant,229596,Nairobi,Mary_from_Nairobi,Low
5,James,24,Nurse,219939,Washington,James_from_Washington,Low
6,Mamadou,28,Nurse,212453,Lagos,Mamadou_from_Lagos,Low
7,Hill,27,Clerk,212269,Burcharest,Hill_from_Burcharest,Low
8,Venn,45,Clerk,209527,Nairobi,Venn_from_Nairobi,Low
9,Jane,33,Sales Manager,199668,Mumbai,Jane_from_Mumbai,Low
10,Claire,39,Accountant,193072,Warsaw,Claire_from_Warsaw,Low
11,Mane,44,Teacher,169931,Mumbai,Mane_from_Mumbai,Low
12,Napoleon,25,Teacher,165957,Moscow,Napoleon_from_Moscow,Low
13,Terry,46,Sales Manager,148843,Mumbai,Terry_from_Mumbai,Low
14,Sane,29,Nurse,121707,Nairobi,Sane_from_Nairobi,Low
15,Joan,30,Clerk,117177,Hanoi,Joan_from_Hanoi,Low

In [107]:
#add salary_label to users_table1
#high if higher than 250000
#low if less than 250000
users_table1['Salary_label']=users_table1['Monthly_Salary'].apply(lambda x: "High" if x>250000 else "Low")
users_table1

,Name,Age,Job_Title,Monthly_Salary,City,name_city,Salary_label
1,Hillary,45,Nurse,277183,Mumbai,Hillary_from_Mumbai,High
2,John,29,Sales Manager,250535,Warsaw,John_from_Warsaw,High
3,Peter,41,Teacher,238860,Washington,Peter_from_Washington,Low
4,Mary,29,Accountant,229596,Nairobi,Mary_from_Nairobi,Low
5,James,24,Nurse,219939,Washington,James_from_Washington,Low
6,Mamadou,28,Nurse,212453,Lagos,Mamadou_from_Lagos,Low
7,Hill,27,Clerk,212269,Burcharest,Hill_from_Burcharest,Low
8,Venn,45,Clerk,209527,Nairobi,Venn_from_Nairobi,Low
9,Jane,33,Sales Manager,199668,Mumbai,Jane_from_Mumbai,Low
10,Claire,39,Accountant,193072,Warsaw,Claire_from_Warsaw,Low
11,Mane,44,Teacher,169931,Mumbai,Mane_from_Mumbai,Low
12,Napoleon,25,Teacher,165957,Moscow,Napoleon_from_Moscow,Low
13,Terry,46,Sales Manager,148843,Mumbai,Terry_from_Mumbai,Low
14,Sane,29,Nurse,121707,Nairobi,Sane_from_Nairobi,Low
15,Joan,30,Clerk,117177,Hanoi,Joan_from_Hanoi,Low

In [110]:
#find occurrence of job titles in users_table1
users_table1['Job_Title'].value_counts()
#most employees are Nurses
#only Accountants are few

Job_Title
Nurse            4
Sales Manager    3
Teacher          3
Clerk            3
Accountant       2
Name: count, dtype: int64

In [113]:
#find total number of employees from Mumbai
employees_from_mumbai=users_table1[users_table1['City']=='Mumbai']
total_employees_from_mumbai=len(employees_from_mumbai)
print("Total employees from Mumbai: ",total_employees_from_mumbai)

Total employees from Mumbai:  4